[  
  
  { "name":"Alchimiste",
    "profile": "Des mages accomplis qui peuvent exploiter au maximum les faiblesses élémentaires d'un ennemi, le dévastant par des formules magiques mortelles. En plus de leurs prouesses élémentaires, ils peuvent empoisonner leurs ennemis, les affaiblissant lentement jusqu'à ce qu'ils tombent et meurent. Grâce à leur connaissance avancée de l'univers des magies, ils peuvent calculer la localisation d'ennemis dangereux, et même transférer leurs camarades en lieu sûr.",
    "strengths": "Des capacités élémentaires mortelles qui leur permettent d'exploiter et d'écraser les faiblesses de l'ennemi.",
    "weaknesses": "Faible défense et HP, ce qui en fait un adversaire de choix pour la première ligne. Peut être difficile à utiliser en début de carrière en raison du coût élevé des TP sans une répartition judicieuse des points de compétence.",
    "imgId": "alchimiste"
  },
  { "name":"Chasseur sombre",
    "profile": "Maîtres de la tromperie, les chasseurs noirs peuvent forcer leurs ennemis à se plier à leur volonté avant de les tuer. Grâce à leur maîtrise du fouet, ils peuvent immobiliser complètement un ennemi avant de s'emparer de sa force vitale. Si un Chasseur Noir décide de prendre la lame à la place, il peut porter des coups puissants aux nerfs de l'ennemi, le détruisant de l'intérieur. Bien que leur puissance soit plus que bienvenue, elle n'est pas sans danger, car le chasseur sombre est capable d'appâter la fureur ennemie avec ses propres camarades.",
    "strengths": "Méthodes variées de débilitation et prouesses au combat, ce qui les rend redoutables malgré leurs défauts. Leur chance naturellement élevée leur permet de porter des coups punitifs fréquemment, avec une excellente précision grâce à leur grande agilité.",
    "weaknesses": "De faibles défenses et des coûts de TP relativement élevés, ce qui les rend très gourmands en TP dans les premiers stades.",
    "imgId": "chasseur_sombre"
  },
  { "name":"Lansquenet",
    "profile": "Puissants et capables d'infliger des dégâts quand vous en avez le plus besoin, les lansquenet n'ont pas peur de se précipiter dans n'importe quelle situation et de se salir les mains, aussi dangereuse soit-elle. Leur force physique se paie au prix de la défense, et si vous êtes prêt à prendre le risque, certaines de leurs compétences peuvent faire pencher la balance encore plus vers la puissance brute en abandonnant complètement la défense. Quelques compétences élémentaires leur permettent d'intervenir même dans les combats contre des ennemis magiques.",
    "strengths": "Offensive élevées, bonne durabilité.",
    "weaknesses": "Croissance médiocre du TP, les compétences de Chaser nécessitent une coopération pour être exécutées.",
    "imgId": "lansquenet"
  },
  { "name":" Survivaliste ",
    "profile": "Des explorateurs à l'esprit vif dont les connaissances en matière de survie en forêt leur donnent un avantage sur leurs ennemis. En partageant leurs secrets avec leurs compagnons de groupe, ils peuvent les aider à devenir plus difficiles à cibler pour l'ennemi. Grâce à leurs connaissances, ils peuvent se déguiser, ce qui leur permet de passer inaperçus alors qu'ils se préparent à décocher un barrage de flèches pour éliminer l'ennemi en toute discrétion.",
    "strengths": "Difficile à toucher, tout en frappant fort. Ils ont une défense moyenne, mais une excellente vitesse. Ils peuvent frapper fréquemment, et plusieurs fois par tour, ce qui leur permet d'arracher les ennemis avant qu'ils n'aient une chance de réagir.",
    "weaknesses": "Une faible puissance de départ combinée à une difficulté à obtenir leurs armes font d'eux une classe délicate à débuter.",
    "imgId": "survivaliste"
  },
  { "name":" Troubadour",
    "profile": "Prodiges en matière de chant et de danse, les Troubadours excellent dans le soutien de leurs coéquipiers lorsque leurs capacités de mêlée sont insuffisantes. Bien qu'ils ne soient pas très doués pour le combat, ils peuvent renforcer divers aspects des statistiques de leurs camarades, et même leur accorder un accès temporaire aux dégâts élémentaires. Leurs chants et danses puissants peuvent également être utilisés pour saper la force de l'ennemi, en écrasant ses défenses élémentaires et en jetant ses avantages de statut à la poubelle.",
    "strengths": "Puissantes capacités de soutien et capacités d'affaiblissement utiles.",
    "weaknesses": "Capacités de mêlée médiocres. Défense médiocre. Mal adapté à tous les types de combat.",
    "imgId": "troubadour"
  },
  { "name":" médecin ",
    "profile": "Guérisseurs polyvalents pour le groupe, les médecins peuvent réparer tous les dégâts infligés. Leurs compétences vont de la guérison des maladies d'état à la guérison des blessures, en passant par la résurrection des membres morts du groupe. Ils peuvent également conférer des effets de statut bénéfiques, tels que la régénération des HP et la résistance aux éléments. De plus, bien que leur faible défense en fasse une proposition risquée, le fait de les mettre en première ligne donne aux médecins étonnamment forts une chance de montrer le genre de dégâts qu'ils peuvent faire.",
    "strengths": "Gamme polyvalente de compétences de soins, bonne puissance d'attaque si nécessaire.",
    "weaknesses": "Faibles défense et HP.",
    "imgId": "medic"
  },
  { "name":"Ronin",
    "profile": "Guerriers étrangers qui possèdent des capacités de combat supérieures. Ces dangereux épéistes peuvent utiliser différentes positions au combat, chacune offrant un bonus au ronin. Grâce à un entraînement intensif, ils peuvent imprégner leurs frappes puissantes d'une puissance élémentaire, délivrant des attaques mortelles en un clin d'œil.",
    "strengths": "Prouesses physiques inégalées, associées à de dangereuses attaques élémentaires. Ils sont capables de faire face à diverses situations, ce qui en fait des alliés de poids.",
    "weaknesses": "Des défenses médiocres, associées à des Stances qui prennent un tour entier à activer, ce qui ralentit effectivement leurs dégâts. Ils ne sont pas accessibles avant le milieu du jeu, et les faire monter en régime demande des efforts.",
    "imgId": "ronin"
  },
  { "name":"Hexer",
    "profile": "Comme son homologue de mêlée, le Chasseur des ténèbres, l'Hexer est capable d'affaiblir ses ennemis avec des maladies d'état. Cependant, contrairement à ses frères, il est capable d'affaiblir ses ennemis par des malédictions bien plus puissantes, allant de l'affaiblissement de la force et de la défense à des malédictions puissantes qui poussent les ennemis à s'entretuer ou même simplement à s'allonger et à mourir.",
    "strengths": "Puissantes malédictions incapacitantes qui réduisent à néant la santé, la force, les défenses, etc. des ennemis.",
    "weaknesses": "Faibles défenses les empêchant d'être en première ligne, accompagnées de capacités offensives médiocres.",
    "imgId": "hexer"
  },
  { "name":"Protecteur",
    "profile": "Les chevaliers sacrés sont spécialisés dans la défense d'eux-mêmes et du reste du groupe. Leurs défenses polyvalentes peuvent être appliquées à eux-mêmes, à une ligne particulière ou à l'ensemble du groupe, protégeant ceux qui en ont le plus besoin. Ne se limitant pas aux défenses physiques, les protecteurs peuvent également se prémunir contre toutes les attaques élémentaires en utilisant Antifire, Anticold ou Antivolt. Leur compétence avec une arme est également redoutable et avec Smite, les Protecteurs sont capables d'utiliser une compétence de dégâts qui peut lier les bras de l'ennemi. Enfin, quelques compétences de soins de base sous la forme de Cure et Cure II complètent leur arsenal.",
    "strengths": "Excellente défense, grande puissance d'attaque, capacités de guérison.",
    "weaknesses": "Les défenses spécifiques sont un pari, pas d'attaques élémentaires, lent à se déplacer s'il ne garde pas.",
    "imgId": "protecteur"
  }
]
